Failed to insert part.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PlaceCutinFittingFailed { get; }
  Visual Basic
Public Shared ReadOnly Property PlaceCutinFittingFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PlaceCutinFittingFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace